Catalogs/АС_Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>АС_Объекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АС_ВидОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АС_Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АС_Объекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьНаСервере() 
	
	Объект.АС_Реквизиты.Очистить(); 
	
	тВид 			= Строка(Объект.Вид); 	
	ИД 				= Объект.Индентификатор;
	
	Для Каждого Метаданное Из Метаданные[тВид][ИД].Реквизиты Цикл 
		НовСтрока = Объект.АС_Реквизиты.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;		
		НовСтрока.РеквизитТип 		= Метаданное.Тип;
		
		//ТипыР = Метаданное.Тип.Типы();
		//Для Каждого стрТип Из ТипыР Цикл
		//	ПоискТип = Метаданные.НайтиПоТипу(стрТип);
		//	Если Не ПоискТип = Неопределено Тогда  
		//		ТипР = Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
		//		
		//		текСправочник = Метаданные.НайтиПоТипу(стрТип).Имя; 
		//	КонецЕсли;
		//КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры
